In [1]:
#import dependencies needed for SQL work
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine
from sqlalchemy import func
from flask import Flask, jsonify
import datetime as dt

from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

from sqlalchemy import Column, Integer, String, Float

import pandas as pd
import numpy as np

In [2]:
#create an engine
engine = create_engine('sqlite:///foreignaid.sqlite', echo=False)

In [3]:
df1 = pd.read_csv('clean_data/gdp_lit_aid.csv')
df2 = pd.read_csv('clean_data/life_clean.csv')
df3 = pd.read_csv('clean_data/sector.csv')
df1 = df1.drop(['id'], axis=1)

In [4]:
df1.head(3)

       country  year  gdp_per_capita  literacy_rate  net_aid_received
0  Afghanistan  1990             0.0            0.0       121720000.0
1  Afghanistan  1991             0.0            0.0       507530000.0
2  Afghanistan  1992             0.0            0.0       204900000.0

In [5]:
df2.head(3)

   year   ida_only  lower_middle_income  low_middle_income   health
0  1990  53.039285            59.513275          63.106052  1613.27
1  1991  53.301928            59.829442          63.326673  1424.84
2  1992  53.582540            60.183902          63.493558  1617.43

In [6]:
df3.head(3)

,year,education,health,government,economic,business,production,multi-sector
0,1990,5664.71,1613.27,1735.06,8382.07,394.33,6878.85,1871.51
1,1991,4973.52,1424.84,1387.19,12182.65,308.94,6199.57,1524.03
2,1992,4793.35,1617.43,1717.47,8038.75,430.42,8069.91,2041.24

In [7]:
#create our ORM classes
class Gdp_Lit_Aid(Base):
    __tablename__ = 'gdp_lit_aid'
    country = Column(String(255), primary_key=True)
    year = Column(Integer)
    gdp_per_capita = Column(Float)
    literacy_rate = Column(Float)
    net_aid_received = Column(Float)

In [8]:
#class for health
class Health(Base):
    __tablename__ = 'health'
    year = Column(Integer, primary_key=True)
    ida_only = Column(Float)
    lower_middle_income = Column(Float)
    low_middle_income = Column(Float)
    health = Column(Float)

In [9]:
#class for spending by sector
class Sector(Base):
    __tablename__ = 'sector'
    year = Column(Integer, primary_key=True)
    education = Column(Float)
    health = Column(Float)
    government = Column(Float)
    economic = Column(Float)
    business = Column(Float)
    production = Column(Float)
    multi_sector = Column(Float)

In [10]:
Base.metadata.create_all(engine)

In [11]:
df1.to_sql('gdp_lit_aid', engine, if_exists = 'replace', index=False)
df2.to_sql('health', engine, if_exists = 'replace', index=False)
df3.to_sql('sector', engine, if_exists = 'replace', index=False)